[
    {
        "title": "Software Engineer II",
        "subsections": [
            {
                "title": "Dell Technologies",
                "date": "August 2021 - Present",
                "points": [
                    "Collaborated on a team managing Dell.com's search functionality, handling approximately 4 million monthly requests for a seamless high-traffic user search experience on a high-traffic website.",
                    "Engineered and managed a full-stack application to boost search relevancy with data insights, leading to a 15% increase in the average rank of the clicked product.",
                    "Led an initiative improving DevOps assessment scores across 18 codebases by addressing vulnerabilities and code quality non-compliance, enhancing system security and reliability."
                ]
            }
        ]
    },
    {
        "title": "Help Desk Student Technician",
        "subsections": [
            {
                "title": "The Bush School of Government and Public Service",
                "date": "June 2019 - May 2021",
                "points": [
                    "Efficiently resolved technical issues for users, employing advanced troubleshooting techniques and ensuring high satisfaction levels with an average ticket response time of less than 1 business day.",
                    "Played a key role in the IT Department's audit preparation, organizing data and over 200 systems to meet stringent compliance standards for a government run institution."
                ]
            }
        ]
    },
    {
        "title": "Software Engineering Intern",
        "subsections": [
            {
                "title": "Dell Technologies",
                "date": "June 2020 - July 2020",
                "points": [
                    "Engineered a cutting-edge microcomponent from the ground up, seamlessly integrated with Dell's internal web platform to facilitate efficient pattern-matching search functionalities."
                ]
            }
        ]
    },
    {
        "title": "Peer Teacher",
        "subsections": [
            {
                "title": "ENGR 102 (Intro to Computation)",
                "date": "August 2018 - May 2019",
                "points": [
                    "Enhanced student learning by providing assistance during classes, fielding questions, and offering feedback on assignments, contributing to a supportive educational environment for over 100 students."
                ]
            }
        ]
    },
    {
        "title": "Independent Student Research",
        "subsections": [
            {
                "title": "CyberHealthGIS Research Experience for Undergraduates",
                "date": "May - August 2018",
                "points": [
                    "Conceptualized and developed a prototype Geographical Information System (GIS) featuring a 3D model of a building highlighting firefighter positions using ArcGIS Maps SDK for JavaScript."
                ]
            },
            {
                "title": "AggiE_Challenge",
                "date": "January - December 2018",
                "points": [
                    "Collaboratively designed and executed a research project focused on analyzing running technique quality through accelerometer data from FitBit devices, demonstrating teamwork and analytical skills."
                ]
            }
        ]
    }
]